---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
source: html/6917ded2-1cfd-788b-bf4a-08bf385ea8d3.htm
---
# AssetPropertyDoubleArray4d Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.